backend/app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = ::Product.all

INSERT INTO "products" ("name", "description", "author", "release_year", "price", "genre", "rating", "created_at", "updated_at") VALUES ('Nhà Giả Kim', 'Tác phẩm nổi tiếng của Paulo Coelho, kể về hành trình theo đuổi giấc mơ và khám phá ý nghĩa cuộc sống', 'Paulo Coelho', 1988, 89000.0, 'Tiểu thuyết – Truyền cảm hứng', 4, '2025-07-25 03:19:43.094596', '2025-07-25 03:19:43.094596') RETURNING "id"
---
  def create
    @product = ::Product.new(product_params)
    if @product.save

UPDATE "products" SET "updated_at" = '2025-10-03 02:54:47.761071' WHERE "products"."id" = 29
---
  def update
    if @product.update(product_params)

SELECT "products".* FROM "products" WHERE "products"."id" = 22 LIMIT 1
---
  def set_product
    @product = ::Product.find(params[:id])