backend/app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@example.com' LIMIT 1
---
  def create
    @user = ::User.find_by(email: params[:email])